# Задание 1
a = 10 * 100
b = 15 * 25
c = a / b
d = a - b * 2
print (d)




# Задание 2
#plates = int(input('Количество тарелок: '))
#detergent1 = plates * 0.5
#print ('Количество требуемового моющего средства:', detergent1)
#while (plates <= detergent1):	
#    detergent1 = plates * 0.5
#    plates1 = (detergent * 2) - plates 
#    print ('Количество немытых тарелок:', plates1)  
#    break
#    plates += 1  
#else:
#	detergent2 = detergent - detergent1
#	print ('Количество оставшегося моющего средства:', detergent2)

# Задание 3
#AB = int(input('Длина катета А: '))
#AC = int(input('Длина катета В: '))
#BC = int(input('Длина гипотенузы: '))
#a = ((AC) ** 2) + ((AB) **2)
#b = ((BC) **2)
#if a > b:	
#    print ('Треугольник не прямоугольный', )
#elif a < b:
#    print ('Треугольник не прямоугольный', )   
#else: 
#	print('Треугольник прямоугольный', )

